; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph2 - mode
	spectrograph3 - mode
	thermograph0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
	(supports instrument1 thermograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star4)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
)
(:goal (and
	(pointing satellite0 Phenomenon5)
	(have_image Phenomenon5 spectrograph2)
	(have_image Planet6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Star8 spectrograph3)
	(have_image Planet9 infrared1)
))

)

; plan
1. (turn_to satellite1 star4 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star4)
   goals met: 0 of 6
2. (turn_to satellite0 star4 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star4)
   goals met: 0 of 6
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
4. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
5. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 6
6. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 6
7. (turn_to satellite0 planet6 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet6)
   goals met: 0 of 6
8. (take_image satellite0 planet6 instrument0 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 1 of 6
9. (turn_to satellite0 star7 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star7)
   goals met: 1 of 6
10. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 2 of 6
11. (turn_to satellite0 star8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star8)
   goals met: 2 of 6
12. (take_image satellite0 star8 instrument0 spectrograph3)
   added: (have_image star8 spectrograph3)
   goals met: 3 of 6
13. (turn_to satellite0 phenomenon5 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 phenomenon5)
   goals met: 4 of 6
14. (take_image satellite0 phenomenon5 instrument0 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   goals met: 5 of 6
15. (turn_to satellite1 planet9 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet9)
   goals met: 5 of 6
16. (take_image satellite1 planet9 instrument1 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 6 of 6
